# Conductor Size Get Conductor Size Id By Name Method

Source: https://www.revitapidocs.com/2026/4fc0ca98-bb35-43ed-e922-7f192b4aac73.htm

---

| Conductor Size Get Conductor Size Id By Name Method |
| --- |

Gets the Conductor Size id by given Conductor Size name.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ElementId GetConductorSizeIdByName(
	Document document,
	string name
)
```

```
Public Shared Function GetConductorSizeIdByName (
	document As Document,
	name As String
) As ElementId
```

```
public:
static ElementId^ GetConductorSizeIdByName(
	Document^ document,
	String^ name
)
```

```
static member GetConductorSizeIdByName :
        document : Document *
        name : string -> ElementId
```

#### Parameters

document Document
:   The document.

name String
:   The Conductor Size name.

#### Return Value

ElementId
The Conductor Size id. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document.  \-or\-  name cannot include prohibited characters, such as "{, }, \[, ], \|, ;, less\-than sign, greater\-than sign, ?, \`, \~".  \-or\-  name is an empty string. |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements). |

See Also

#### Reference

ConductorSize Class Autodesk.Revit.DB.Electrical Namespace